function randomInt(min, max) {
	if (min >= 0 && max > 0 && max >= min) {
		let gab = max - min + 1;
		return Math.floor(Math.random() * gab + min);
	} else {
		return 0;
	}
}

// 随机获取一个姓
// TODO：允许以常见姓为基础增加权重
// abs:是否采用绝对随机的方式，如果为 true，则可能出现不常见的姓(暂未实现)
function getSurname(abs = false) {

	let surnames = ['李', '王', '张', '刘', '陈', '杨', '赵', '黄', '周', '吴', '徐', '孙', '胡', '朱', '高', '林', '何', '郭', '马', '岁',
		'梁', '宋', '郑', '谢', '韩', '冯', '于', '董', '萧', '程', '曹', '袁', '邓', '许', '傅', '沈', '曾', '彭', '吕', '苏', '蒋',
		'蔡', '贾', '丁', '魏', '薛', '圆', '余', '潘', '杜', '戴', '夏', '钟', '注', '田', '任', '姜', '范', '方', '石', '姚',
		'谭', '廖', '邹', '熊', '金', '陆', '郝', '白', '崔', '康', '毛', '邱', '江', '史', '顾', '侯', '孟', '龙', '万', '段',
		'漕', '钱', '汤', '黎', '易', '常', '武', '乔', '贺', '赖', '龚', '文', '庞', '楼', '兰', '殷', '施', '陶', '洪', '翟', '安',
		'颜', '倪', '牛', '温', '芦', '季', '章', '鲁', '葛', '伍', '韦', '毕', '夏', '燃', '焦', '向', '柳', '路', '岳',
		'齐', '沿', '梅', '莫', '庄', '辛', '管', '祝', '左', '涂', '谷', '祁', '时', '舒', '耿', '呼', '路', '詹', '关', '苗', '凌',
		'费', '纪', '靳', '盛', '童', '欧', '甄', '项', '曲', '成', '游', '裴', '席', '查', '屈', '鲍', '位', '覃', '霍',
		'翁', '隋', '植', '甘', '景', '薄', '单', '包', '司', '柏', '宁', '柯', '元', '桂', '闵', '欧阳', '解', '强', '柴', '华', '车',
		'冉', '房', '边', '事', '饶', '入', '厘', '威', '丘', '米', '池', '滕', '晋', '苑', '减', '畅', '宫', '来', '瞪', '苟', '全',
		'褚', '廉', '简', '盖', '符', '奚', '木', '党', '燕', '郎', '邸', '算', '谈', '姬', '屠', '连', '郜', '号', '栾', '郁', '商',
		'蒙', '计', '揭', '窦', '迟', '字', '敖', '糜', '鄢', '冷', '卓', '花', '仇', '蓝', '都', '月', '稽', '练', '仲',
		'乐', '虞', '卡', '封', '竺', '洗', '官', '衣', '楚', '佟', '栗', '匡', '宗', '应', '台', '巫', '鞠', '僧', '桑', '荆', '谌',
		'银', '扬', '明', '沙', '薄', '伏', '岁', '习', '胥', '保', '和', '蔺', '家'
	]
	return surnames[randomInt(0, surnames.length - 1)]
}

// 随机获取一个名字
// num(字数)
// gender 性别化（0：男性化；1：女性化）
// hasSurname 是否随机添加一个姓
function getName(gender = 0, num = 2, hasSurname = false) {
	let mWords = ['刚', '守', '成', '崇', '泊', '清', '青', '庆', '齐', '家', '治', '国', '平', '天', '生', '民', '若', '文', '金', '承',
		'华', '春', '流', '伯', '晓'
	]
	let fWords = ['燕', '巧', '娇', '艳', '娜', '倩', '佳', '伊', '宜', '怡', '聪', '鑫', '雪', '芳', '萍', '苹', '翠', '晓', '桂', '波',
		'素', '淑', '君', '静', '海'
	]
	let name = ''
	for (let i = 0; i < 2; i++) {
		if (gender == 0) {
			name += mWords[randomInt(0, mWords.length - 1)]
		} else {
			name += fWords[randomInt(0, fWords.length - 1)]
		}
	}
	if(hasSurname){
		name = getSurname() + name
	}
	return name
}

// 随机获取一个地址
// province 指定省份
// city 指定市
function getAddress(){
	
}
// 随机获取一个手机号
// type: 0中国移动 1中国联通 2中国电信
function getPhoneNumber(){
	
}
// 随机生成一个身份证号
// province 指定省份
// city 指定市
// gender 指定性别
// dateOfBirth 指定出生日期
function getIDNumber(){
	
}


export default {
	randomInt,
	getSurname,
	getName
}
